<?php
// +----------------------------------------------------------------------
// |ZBPHP[基于ThinkPHP5.1开发]
// +----------------------------------------------------------------------
// | Copyright (c) 2016-2019 http://www.benbenwangluo.com
// +----------------------------------------------------------------------
// | Author 似水星辰 [ 2630481389@qq.com ]
// +----------------------------------------------------------------------
// | 中犇软件 技术六部 出品
// +----------------------------------------------------------------------

namespace app\admin\validate;

use think\Validate;

/**
 * 菜单验证器
 * @package app\admin\validate
 * @author 似水星辰 [ 2630481389@qq.com ]
 */
class Menu extends Validate
{
    //定义验证规则
    protected $rule = [
        'pid|所属菜单'    => 'require|token',
        'title|菜单名称'  => 'require',
    ];

    //定义验证提示
    protected $message = [
        'pid.require'    => '请选择所属菜单',
		'title.require'    => '请选择菜单名称',
    ];
}
