<?php
// +----------------------------------------------------------------------
// |ZBPHP[基于ThinkPHP5.1开发]
// +----------------------------------------------------------------------
// | Copyright (c) 2016-2019 http://www.benbenwangluo.com
// +----------------------------------------------------------------------
// | Author 似水星辰 [ 2630481389@qq.com ]
// +----------------------------------------------------------------------
// | 中犇软件 技术六部 出品
// +----------------------------------------------------------------------

namespace app\{module}\validate;

use think\Validate;

/**
 * {title}验证器
 * @package app\{module}\validate
 * @author 似水星辰 [2630481389@qq.com]
 */
class {model} extends Validate
{
    //定义规则
    protected $rule = [
        
    ];

    protected $message = [
        
    ];

    // 定义验证场景
    protected $scene = [
        
    ];
}
